--- a/README.md
+++ b/README.md
@@ -75,45 +103,66 @@ The engine is divided into two core binaries:
 
 A strict separation ensures minimal overhead in runtime and clean module interfaces.
 
-```plantuml
-@startuml
-package "Game Engine" {
-  [Runtime]
-  [Editor]
-  [Project Launcher]
-  [Module Manager] --> [Runtime]
-  [Module Manager] --> [Editor]
-  [Project Launcher] --> [Editor]
-  [Project Launcher] --> [Runtime]
-}
+```mermaid
+graph TD
+    subgraph Base
+        Containers
+        Strings
+        Allocators
+        ...
+    end
 
-package "Runtime" {
-  [Core System] --> [Platform Abstraction Layer]
-  [Renderer] --> [Core System]
-  [Audio System] --> [Core System]
-  [Input System] --> [Core System]
-  [ECS Core] --> [Core System]
-  [Job System] --> [Core System]
-  [Module Loader] --> [Core System]
-}
+    subgraph Game_Engine [Game Engine]
+        Runtime
+        Editor
+        Project_Launcher[Launcher]
+        Windows
+        Linux
 
-package "Editor" {
-  [Editor UI] --> [Core System]
-  [Scene Graph Editor] --> [ECS Core]
-  [Profiler] --> [Job System]
-}
+        Editor --> Project_Launcher
+        Runtime --> Project_Launcher
+        Base --> Windows
+        Base --> Linux
+        Base --> Runtime
+        Base --> Editor
+    end
 
-[Platform Abstraction Layer] --> [Win32 API]
-[Platform Abstraction Layer] --> [Linux]
-@enduml
+    subgraph Runtime
+        Core
+        Platform_Abstraction_Layer[Platform Abstraction Layer]
+        Renderer
+        Audio
+        Input
+
+        Platform_Abstraction_Layer --> Core
+        Platform_Abstraction_Layer --> Renderer
+        Platform_Abstraction_Layer --> Audio
+        Platform_Abstraction_Layer --> Input
+        Renderer --> Core
+        Audio --> Core
+        Input --> Core
+    end
+
+    subgraph Editor
+        Editor_UI[Editor UI]
+        Scene_Graph_Editor[Scene Graph Editor]
+        Profiler
+        Module_Loader[Module Loader]
+    end
+
+    Windows --> Platform_Abstraction_Layer
+    Linux --> Platform_Abstraction_Layer
 ```
+The graph represents the top-down hierarchy. This means that at the top we have the libraries that do not depend on
+anything else.
 
